Repository: SELab-2/Dr-Trottoir-4
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: nl

source: a user is already registered with this e-mail address
nl: een gebruiker is al geregistreerd met dit e-mailadres

source: {data['email']} has no entry in the lobby, you must contact an admin to gain access to the platform
nl: {data['email']} zit niet in de lobby, u moet contact opnemen met een beheerder om toegang te krijgen tot het platform

source: invalid verification code
nl: ongeldige verificatiecode

source: the two password fields didn't match.
nl: de twee wachtwoordvelden komen niet overeen

source: no valid refresh token found
nl: geen geldige refresh token gevonden

source: successfully logged out
nl: succesvol uitgelogd

source: refresh token was not included in request cookies
nl: refresh token was niet in de request cookies opgenomen

source: an error has occurred.
nl: er is een fout opgetreden

source: successful login
nl: succesvol ingelogd

source: refresh of tokens successful
nl: tokens succesvol vernieuwd

source: refresh token validation successful
nl: refresh token validatie succesvol

source: new password has been saved
nl: nieuw wachtwoord is opgeslagen

source: This region already exists
nl: Deze regio bestaat al

source: The maximum rank allowed is {highest_rank}.
nl: De hoogste toegestane rang is {highest_rank}.

source: This role name already exists.
nl: Deze rolnaam bestaat al.

source: A user already exists with this email.
nl: Er bestaat al een gebruiker met deze e-mail

source: This email is already in the lobby.
nl: Dit e-mailadres is al in de lobby aanwezig.

source: This verification code already exists.
nl: Deze verificatiecode bestaat al.

source: This email belongs to an INACTIVE user. Instead of trying to register this user, you can simply reactivate the account.
nl: Dit e-mailadres hoort bij een INACTIEVE gebruiker. In plaats van deze gebruiker te proberen te registreren, kunt u het account eenvoudig reactiveren.

source: Email already exists in database for a user (id: {user_id}).{addendum}
nl: E-mailadres bestaat al in de database voor een gebruiker (id: {user_id}).{addendum}

source: The house number of the building must be positive and not zero.
nl: Het huisnummer van het gebouw moet een positief getal zijn, groter dan nul.

source: Only a user with role "syndic" can own a building.
nl: Alleen een gebruiker met de rol "syndicus" kan een gebouw bezitten.

source: {public_id} already exists as public_id of another building
nl: {public_id} bestaat al als public_id van een ander gebouw

source: A building with this address already exists.
nl: Er bestaat al een gebouw met dit adres.

source: This comment already exists, and was posted at the exact same time.
nl: Deze opmerking bestaat al, en is op exact hetzelfde moment geplaatst.

source: This type of garbage is already being collected on the same day for this building.
nl: Dit soort afval wordt al op dezelfde dag voor dit gebouw opgehaald.

source: There is already a tour with the same name in the region.
nl: Er bestaat al een tour met dezelfde naam in de regio.

source: The regions for tour ({tour_region}) and building ({building_region}) are different.
nl: De regio's voor tour ({tour_region}) en gebouw ({building_region}) zijn verschillend.

source: This building is already on this tour.
nl: Dit gebouw staat al op deze tour.

source: This index is already in use.
nl: Deze index is al in gebruik

source: You cannot plan a student on a past date.
nl: Je kan geen student in het verleden plannen.

source: A syndic can't do tours
nl: Een syndicus kan geen rondes doen

source: Student ({user_email}) doesn't do tours in this region ({tour_region}).
nl: Student ({user_email}) doet geen rondes in deze regio ({tour_region}).

source: The student is already assigned to this tour on this date.
nl: De student is al toegewezen aan deze tour op deze datum.

source: There already exists a remark of this type from this student on tour at this building.
nl: Er bestaat al een opmerking van dit type van deze student op tour in dit gebouw.

source: This remark was already uploaded to this building by this student on the tour.
nl: Deze opmerking is al geüpload naar dit gebouw door deze student op de tour.

source: The building already has this upload.
nl: Het gebouw heeft al deze upload.

source: The building already has a manual with the same version number
nl: Het gebouw heeft al een handleiding met hetzelfde versienummer

source: The name for this template already exists.
nl: De naam van deze template bestaat al.

source: Admin permission required
nl: Admin permissie vereist

source: Super student permission required
nl: Superstudent permisie vereist

source: Student permission required
nl: Student permissie vereist

source: Students are only allowed to read
nl: Studenten mogen alleen lezen

source: Syndic permission required
nl: Syndicus permissie vereist

source: You can only access/edit the buildings that you own
nl: Je kan alleen de gebouwen zien/bewerken die je zelf bezit

source: You can only read the building that you own
nl: Je kan enkel de gebouwen lezen die je zelf bezit

source: You can only patch the building public id and the name of the building that you own
nl: Je kan alleen de public id en de naam van een gebouw bewerken dat je zelf bezit

source: You can only access/edit your own account
nl: Je kan alleen je eigen account zien/bewerken

source: You can only access your own account
nl: Je kan alleen je eigen account raadplegen

source: You can't create a user of a higher role
nl: Je kan geen gebruiker met een hogere rol aanmaken

source: You don't have the right permissions to delete this user
nl: Je hebt niet de juiste permissies om deze gebruiker te verwijderen

source: You don't have the right permissions to edit this user
nl: Je hebt niet de juiste permissies om deze gebruiker te bewerken

source: You can't assign a role to yourself or assign a role that is higher than your own
nl: Je kan geen rol toekennen aan jezelf of een rol toekennen die hoger is dan je eigen rol

source: You can only view manuals that are linked to one of your buildings
nl: Je kan enkel handleidingen bekijken die gelinkt zijn aan een van je eigen gebouwen

source: You cannot edit buildings on a tour when a student is actively doing the tour
nl: Je kan geen gebouwen bewerken op een ronde wanneer een student actief is op de ronde

source: Building (with id {id})
nl: Gebouw (met id {id})

source: Dutch
nl: Nederlands

source: English
nl: Engels

source: The parameter(s) 'region' (id) and/or 'tour' (id) and/or 'buildings' (list of id's) should be given
nl: De parameter(s) 'region' (id) en/of 'tour' (id) en/of 'buildings' (lijst van id's) moet(en) gegeven worden

source: Cannot use both most-recent and date for RemarkAtBuilding
nl: Je kan niet zowel most-recent als de date query parameter gebruiken gebruiken voor RemarkAtBuilding

source: Email is required
nl: E-mail is vereist

source: Superuser must have is_staff=True.
nl: Superuser moet is_staff=True hebben.

source: Superuser must have is_superuser=True.
nl: Superuser moet is_superuser=True hebben.

source: The query parameter {name} should be an integer
nl: De query parameter {name} moet een getal zijn

source: The query parameter {name} is required
nl: De query parameter {name} is vereist

source: The date parameter '{name}': '{param}' hasn't the appropriate form (=YYYY-MM-DD).
nl: De datum parameter '{name}': '{param}' heeft niet het juiste formaat (=YYYY-MM-DD).

source: Invalid value for boolean parameter '{name}': '{param}' (true or false expected)
nl: Ongeldige booleaanse parameter '{name}': '{param}' (true of false verwacht)

source: {} was not found
nl: {} werd niet gevonden

source: bad input for {}
nl: slechte input voor {}

source: There is no {object1} that is linked to {object2} with given id.
nl: Er is geen {object1} dat gelinkt is aan {object2} met de gegeven id.

source: the start date of the period can't be in a later week than the week of the end date
nl: de startdatum van de periode kan niet in een latere week zijn dan de einddatum

source: the start date of the period to which you want to copy must be, at a minimum, in the week immediately following the end date of the original period
nl: de startdatum van de periode waarnaar je wilt kopiëren moet, op zijn minst, in de week direct volgend na de einddatum van de originele periode liggen
